// pages/mainBusiness/mainBusiness.js
// pages/newsCenter/newsCenter.js
var onlyText;
var statusArrs = [];
for (var i = 0; i < 5; i++) {
  statusArrs.push(true);
};
Page({

  /**
   * 页面的初始数据
   */
  data: {
    onlyText:true,
    list: ['公司介绍', '关于康泽', '新闻中心', '主营业务', '经营品牌', '人才发展', '交流中心'],
    shopitem: '主营业务',   //默认显示的

    indexSize: 0,
    index: 0,
    showArr: statusArrs,

    imgindex: "0",
    classData: [
      {
        image: '../../img/mainBanner/oicon_01_03.png',
        title: "旗下企业",
        clickUrl: "../../img/mainBanner/oicon_01_02.png"
      },
      {
        image: '../../img/mainBanner/oicon_01_08.png',
        title: "业务领域",
        clickUrl: "../../img/mainBanner/oicon_01_09.png"
      },
      {
        image: '../../img/mainBanner/oicon_01_07.png',
        title: "核心业务",
        clickUrl: "../../img/mainBanner/oicon_01_06.png"
      },
      {
        image: '../../img/mainBanner/oicon_01_14.png',
        title: "门店信息",
        clickUrl: "../../img/mainBanner/oicon_01_13.png"
      },
    ],
    indexId: 0,

    //门店信息
    listData: [
      { "code": "01", "text": "朝阳和平中寨店", "type": "汕头市潮阳区和平镇中寨和惠路80号一层铺面" },
      { "code": "02", "text": "潮南峡山西沟店", "type": "汕头市潮南区峡山街道西沟村干鲜市场主干道18-21号底层" },
      { "code": "03", "text": "潮南峡山恩波店", "type": "汕头市潮南区峡山街道恩波路中段" },
      { "code": "04", "text": "潮南峡山泗联店", "type": "汕头市潮南区峡山街道金都新区东一街47-51号一层铺面" },
      { "code": "05", "text": "潮南峡山南里店", "type": "汕头市潮南区峡山街道南里居委广祥路616号一层铺面" },
      { "code": "06", "text": "潮南峡山义英分店", "type": "汕头市潮南区峡山街道义英峡华路737、739、741号一层" },
      { "code": "07", "text": "潮南峡山东环店", "type": "汕头市潮南区峡山街道峡山居委东环路129、131号一层" },
      { "code": "08", "text": "潮南峡山丹凤店", "type": "汕头市潮南区峡山街道峡山丹凤路134、136号首层" },
      { "code": "9", "text": "潮南胪溪分店", "type": "汕头市潮南区胪岗镇和惠公路胪溪路段74、76号首层" },
      { "code": "10", "text": "潮阳和平新和店", "type": "汕头市潮阳区和平镇和惠路西一层" },
      { "code": "11", "text": "潮南胪岗桥西店", "type": "潮阳市胪岗镇泗和桥西片" },
      { "code": "12", "text": "潮阳铜钵盂分店", "type": "汕头市潮阳区铜盂镇铜钵盂新兴路123-125号首层" },
      { "code": "13", "text": "潮阳和平塘围分店", "type": "汕头市潮阳区和平镇塘围市场A07-08铺面" },
      { "code": "14", "text": "潮阳西胪西一分店", "type": "汕头市潮阳区西胪镇综合市场大三角商住楼一层铺面" },
      { "code": "15", "text": "潮阳西胪市场东分店", "type": "汕头市潮阳区西胪镇综合市场29幢7-8首层" },
      { "code": "16", "text": "澄海上华渡头分店", "type": "汕头市澄海区上华镇渡头村下洲工业区" },
      { "code": "17", "text": "澄海宜嘉名都店", "type": "汕头市澄海区同益路南侧宜嘉名都花园17幢一层B66-67号" },
      { "code": "18", "text": "澄海龙田分店", "type": "澄海区澄江路北龙田综合市场98-100号" },
      { "code": "19", "text": "澄海澄江店", "type": "澄海区上华镇蛟头叶鹏发家私城第4-6号共3间" },
      { "code": "20", "text": "澄海分公司", "type": "汕头市澄海城区阜德园5幢一层1、+1号" },
      { "code": "21", "text": "澄海红头船店", "type": "澄海区碧榕苑第9幢第13号铺面" },
      { "code": "22", "text": "澄海上华横陇分店", "type": "汕头市澄海区上华镇横陇村澄江路边" },
      { "code": "23", "text": "澄海玉亭分店", "type": "汕头市澄海区玉亭路南侧金丽娜酒店管理有限公司一层" },
      { "code": "24", "text": "澄海宜居华庭分店", "type": "汕头市澄海区澄江路宜居华庭16～17幢一层A14号" },
      { "code": "25", "text": "澄海环西分店", "type": "汕头市澄海区广益街道城北古巷头1号" },
      { "code": "26", "text": "澄海澄江花园分店", "type": "汕头市澄海区澄江花园1001-1007幢一层7+8号" },
      { "code": "27", "text": "澄海文祠西分店", "type": "汕头市澄海区澄华街道西门文祠西路45幢一层8、9、10、11铺面" },
      { "code": "28", "text": "汕头外砂分店", "type": "汕头市龙湖区外砂镇海富花园C1栋113-115号" },
      { "code": "29", "text": "澄海澄华下窖分店", "type": "汕头市澄海区澄华街道澄华路下窖桥头沟北11巷10号一层" },
      { "code": "30", "text": "澄海兴华分店", "type": "汕头市澄海区澄华街道冠山兴华路沙堀片路段" },
      { "code": "31", "text": "澄海宜景轩分店", "type": "汕头市澄海区宁冠路宜景轩（公安局斜对面）" },
      { "code": "32", "text": "澄海冠山分店", "type": "汕头市澄海城区文冠路尾（与兴华路交界处）" },
      { "code": "33", "text": "汕头外砂文祠分店", "type": "汕头市龙湖区外砂镇文祠中路第五幢商住楼一层07-08号" },
      { "code": "34", "text": "南澳云澳分店", "type": "汕头市南澳县云澳镇新村西片61-2号之东、西首层" },
      { "code": "35", "text": "澄海四方井分店", "type": "汕头市澄海区益民路树东园2幢一层4-5号" },
      { "code": "36", "text": "澄海车站分店", "type": "汕头市澄海区老国道华侨大厦沿街商铺（汽车总站斜对面）" },
      { "code": "37", "text": "澄海坝头分店", "type": "汕头市澄海区凤翔街道头份社区三围市场南面铺地第15-16号" },
      { "code": "38", "text": "澄海南门分店", "type": "汕头市澄海区中山南路凤岗里街口（原烟草局）" },
      { "code": "39", "text": "澄海玉兰苑分店", "type": "汕头市澄海区美江路2号一层（澄海区澄华街道美埭“洲园片”）" },
      { "code": "40", "text": "澄海万盛园分店", "type": "汕头市澄海区环城东路万盛园10栋39号" },
      { "code": "41", "text": "南澳后宅龙滨分店", "type": "南澳县后宅镇龙滨路96、98号一层" },
      { "code": "42", "text": "澄海陆厝围分店", "type": "汕头市澄海区望美中街60号东侧" },
      { "code": "43", "text": "澄海环东分店", "type": "汕头市澄海区凤翔街道益民路常春园4栋12号及加12号铺面" },
      { "code": "44", "text": "澄海一中分店", "type": "澄海陆厝围新村D20幢一层1-2号" },
      { "code": "45", "text": "澄海八角楼分店", "type": "汕头市澄海区中心城区八角楼新村7幢之一" },
      { "code": "46", "text": "澄海凤新一分店", "type": "环城南路老干部活动中心西侧（城南小学对面）" },
      { "code": "47", "text": "澄海信宁分店", "type": "汕头市澄海区凤翔路17号第1-2间铺面" },
      { "code": "48", "text": "澄海益民分店", "type": "汕头市澄海区澄华西门振兴路7幢12-13号铺面" },
      { "code": "49", "text": "澄海环北分店", "type": "澄海区金城园26幢一层4-5号" },
      { "code": "50", "text": "澄海坝头涂池分店", "type": "汕头市澄海区坝头镇涂池村荣福路北5巷2号" },
      { "code": "51", "text": "澄海莲凤店", "type": "汕头市澄海区莲下镇建阳村莲凤路段1号铺面" },
      { "code": "52", "text": "澄海盐鸿分店", "type": "汕头市澄海区盐鸿镇盐鸿大道老邮电局（港头溪头埔）" },
      { "code": "53", "text": "澄海竹林分店", "type": "汕头市澄海区莲上镇竹林村竹林大池" },
      { "code": "54", "text": "澄海莲中分店", "type": "汕头市澄海区莲上老邮电局" },
      { "code": "55", "text": "澄海溪南分店", "type": "汕头市澄海区溪南镇金溪路（镇道边）" },
      { "code": "56", "text": "澄海南美分店", "type": "溪南镇内厝村北横坽第14幢4号" },
      { "code": "57", "text": "澄海隆都车站分店", "type": "汕头市澄海区隆都镇鹊巷村安澄公路38号一层" },
      { "code": "58", "text": "澄海莲东分店", "type": "汕头市澄海区莲下镇莲东路新寮路段2幢18号一层铺面" },
      { "code": "59", "text": "澄海樟林分店", "type": "汕头市澄海区东里镇河美村中山路西1-2号一层铺面" },
      { "code": "60", "text": "澄海樟东店", "type": "汕头市澄海区东里樟东市场周边铺屋列1-2号一层" },
      { "code": "61", "text": "澄海北湾分店", "type": "汕头市澄海区莲下镇北湾村主干道第3-4号一层铺面" },
      { "code": "62", "text": "澄海莲下立德分店", "type": "汕头市澄海区莲下镇立德村浮宫前一巷2号" },
      { "code": "63", "text": "澄海盐鸿鸿三分店", "type": "汕头市澄海区盐鸿镇鸿三村大掘底八横16号" },
      { "code": "64", "text": "澄海东里分店", "type": "汕头市澄海区东里镇老汕汾公路南侧第13-14铺面（原老布市）" },
      { "code": "65", "text": "澄海莲阳分店", "type": "汕头市澄海区莲下镇莲阳大街老邮电局" },
      { "code": "66", "text": "澄海莲上分店", "type": "汕头市澄海区莲上镇莲中路1-4号（原金凤楼下）" },
      { "code": "67", "text": "澄海梅陇洋店", "type": "汕头市澄海区东里镇东陇梅陇洋片区商铺一层5-6号铺面" },
      { "code": "68", "text": "澄海莲下南湾分店", "type": "汕头市澄海区莲下镇南湾村内港西5巷" },
      { "code": "69", "text": "澄海端本分店", "type": "汕头市澄海区莲下镇槐东村公洲公州头15号铺面" },
      { "code": "70", "text": "澄海隆都分店", "type": "澄海区隆都镇店市兴隆大街西侧C幢一楼1-5号" },
    ],
    listData2: [
      { "code": "71", "text": "河源紫金城南店", "type": "紫金县紫城镇城南上坝南岗路15号" },
      { "code": "72", "text": "河源紫金柏埔店", "type": "紫金县柏埔镇开发区沿江路" },
      { "code": "73", "text": "河源紫金晋安居店", "type": "紫金县紫城镇晋安居之1-5、1-6、1-7号" },
      { "code": "74", "text": "河源紫金广场店", "type": "紫金县紫城镇广场五路第一屋右边两卡" },
      { "code": "75", "text": "河源紫金东风路分店", "type": "紫金县紫城镇东风路19号" },
      { "code": "76", "text": "河源紫金三丫角店", "type": "紫金县紫城镇乌石村三丫角" },
      { "code": "77", "text": "河源紫金金紫金广场店", "type": "紫金县紫城镇新紫路198号金紫金广场商铺110号、111号、" },
      { "code": "78", "text": "", "type": "112之一号" },
      { "code": "79", "text": "河源兴源东路分店", "type": "河源市新市区兴源东路20号" },
      { "code": "80", "text": "河源华达街分店", "type": "河源市华达街东面建设大道北面静逸居A106号" },
      { "code": "81", "text": "河源真品药店", "type": "河源市新市区建设大道南边新风路东边鸿翔华庭B栋102-105号" },
      { "code": "82", "text": "", "type": "一层铺面" },
      { "code": "83", "text": "河源文昌路分店", "type": "河源市新市区文昌路236号1层商铺" },
      { "code": "84", "text": "河源万隆花园分店", "type": "河源市新市区永和路南边新风路西边万隆花园A1栋006号" },
      { "code": "85", "text": "河源文景分店", "type": "河源市新市区文明路北边新风路东边瑞生花园B07-1号" },
      { "code": "86", "text": "河源紫金新安分店", "type": "紫金县紫城镇西郊B-3小区" },
      { "code": "87", "text": "河源新江分店", "type": "源城区火车站小区经十路东边福新大厦1栋81-025、81-256A号" },
      { "code": "88", "text": "河源雅居乐一分店", "type": "河源市区东城西片区纬十四路北边、文昌路东边雅居乐花园4号" },
      { "code": "89", "text": "", "type": "商铺B1112、A1113、A1115号" },
      { "code": "90", "text": "梅州旭日华庭店", "type": "梅州市江南路旭日华庭A栋5、6号" },
      { "code": "91", "text": "梅州黄塘分店", "type": "梅州市梅州三路88号" },
      { "code": "92", "text": "梅州分公司", "type": "梅州市江南路19号家乐苑4-5号" },
      { "code": "93", "text": "汕头金晖分店", "type": "汕头市龙湖区金晖庄汇轩雅居东区2幢102号" },
      { "code": "94", "text": "汕头龙眼二分店", "type": "汕头市金平区龙眼路67号103、104号房" },
      { "code": "95", "text": "汕头广厦市场二分店", "type": "汕头市新广厦综合市场临街第012、013、014号商铺" },
      { "code": "96", "text": "汕头金涛分店", "type": "汕头市龙湖区金涛庄西区36幢2/107,108号" },
      { "code": "97", "text": "汕头广厦市场一分店", "type": "汕头市新广厦综合市场临街第032、033号商铺" },
      { "code": "98", "text": "汕头丰泽分店", "type": "汕头龙湖区金砂路160号华尔花园6憧110-111号" },
      { "code": "99", "text": "汕头丰华分店", "type": "汕头市龙湖区丰华庄星湖嘉景花园3幢107号铺面" },
      { "code": "100", "text": "汕头长江分店", "type": "汕头市龙湖区长江路96号之（二）厂房B幢全座1-2号铺面" },
      { "code": "101", "text": "汕头碧霞分店", "type": "汕头市龙湖区碧霞庄北区17幢112号房" },
      { "code": "102", "text": "汕头金泰分店", "type": "汕头市金泰庄北区1幢南北座8、9幢116、117铺面" },
      { "code": "103", "text": "汕头桃园分店", "type": "金平区桃园28幢108-109号铺面" },
      { "code": "104", "text": "汕头丹阳分店", "type": "汕头市丹阳庄东区合美大楼103、104号房" },
      { "code": "105", "text": "汕头翠英分店", "type": "汕头市龙湖区珠江路金润花园第6、7幢104号房" },
      { "code": "106", "text": "汕头龙涛分店", "type": "汕头市龙湖区长平路龙涛花园A21-22号（世贸花园对面）" },
      { "code": "107", "text": "汕头长平分店", "type": "汕头市长平路56号梅园23幢109-110号" },
      { "code": "108", "text": "汕头迎春分店", "type": "汕头市迎春路3号101" },
      { "code": "109", "text": "汕头海滨花园分店", "type": "汕头市龙湖区中山东路海滨花园西区市场右侧01号" },
      { "code": "110", "text": "汕头华坞二分店", "type": "汕头市金平区华坞路16号1幢104、105号" },
      { "code": "111", "text": "汕头华坞分店", "type": "汕头市金平区华坞路21号110-111号铺面" },
      { "code": "112", "text": "汕头红领巾分店", "type": "汕头市红领巾路56号一座111及112房" },
      { "code": "113", "text": "汕头民权分店", "type": "汕头市外马路95号信逸雅园4幢107-1号商铺" },
      { "code": "114", "text": "汕头外马分店", "type": "汕头市外马路70号汇涛雅居2-4幢14-15号" },
      { "code": "115", "text": "汕头沿江分店", "type": "汕头市沿江南路10号（锦星华庭）1、4幢铺面108号" },
      { "code": "116", "text": "汕头三身人分店", "type": "汕头市金平区新湖祠前二横1号" },
      { "code": "117", "text": "汕头金新南分店", "type": "汕头市金平区长平路41号（沿金新路）一层东侧4-6号" },
      { "code": "118", "text": "汕头大华分店", "type": "汕头市金平区大华路27号1幢101-103号房" },
      { "code": "119", "text": "汕头新厦分店", "type": "汕头市金平区新厦路12号1幢105房" },
      { "code": "120", "text": "汕头春杏分店", "type": "汕头市金平区春杏路20号106-107号" },
      { "code": "121", "text": "汕头松园分店", "type": "汕头市飞厦28座5号门109-110号房" },
      { "code": "122", "text": "汕头龙眼分店", "type": "汕头市金平区龙眼南路26号104号铺面" },
      { "code": "123", "text": "汕头榕江分店", "type": "汕头市龙湖区榕江路16号环碧庄侨苑第7幢1层111、第8幢1层" },
      { "code": "124", "text": "", "type": "101铺面" },
      { "code": "125", "text": "汕头朝阳分店", "type": "汕头市龙湖区朝阳庄海富大厦3/104号铺面" },
      { "code": "126", "text": "汕头南墩分店", "type": "汕头市金平区南墩东安二路南七巷1号一层铺面" },
      { "code": "127", "text": "汕头新溪分店", "type": "汕头市龙湖区新溪镇八合村中兴街商铺E幢" },
      { "code": "128", "text": "汕头金碧庄分店", "type": "汕头龙湖区金碧庄东区36幢103号" },
      { "code": "129", "text": "汕头韩江分店", "type": "汕头市黄山路12号万泰春天花园西区1、2幢106号" },
      { "code": "130", "text": "汕头樱花园分店", "type": "汕头市金平区樱花园1幢101号房" },
      { "code": "131", "text": "汕头黄河分店", "type": "汕头市龙湖区华美花园17、20座" },
      { "code": "132", "text": "汕头内充公分店", "type": "汕头市珠池街道内充公村南山街东18巷22号之二" },
      { "code": "133", "text": "汕头新溪中三合分店", "type": "汕头市龙湖区新溪镇中三合市场西南侧首层" },
      { "code": "134", "text": "汕头朝阳西街分店", "type": "汕头市龙湖区朝阳庄中区18幢106号房" },
      { "code": "135", "text": "汕头春江分店", "type": "龙湖区君悦春江花园1幢104号商铺" },
      { "code": "136", "text": "汕头新溪北中分店", "type": "汕头市龙湖区新溪镇北中村9队（北兴路口与中兴路口交界）" },
      { "code": "137", "text": "汕头鸥汀分店", "type": "汕头市龙湖区鸥下龟桥南路141号" },
      { "code": "138", "text": "汕头东厦良济堂分店", "type": "汕头市金平区春兰园8、9幢101、102号房" },
      { "code": "139", "text": "汕头荷花园分店", "type": "汕头市东厦北路木兰园21-23幢首层（即汕大医学院第二附属" },
      { "code": "140", "text": "", "type": "医院对面）" },
    ],
    
    bg: true,
  },
  pagination: function (event) {
    console.log(this.data.onlyText)
    var value = !this.data.onlyText;
    this.setData({
      onlyText: value,
      bg: false
    })
  },
  bindshop: function (event) {
    var classify = event.currentTarget.dataset.classify;
    var index = event.currentTarget.dataset.index;
    if (index === 0) {
      wx.navigateTo({
        url: '../companyProfile/companyProfile'
      })
    }
    if (index === 1) {
      wx.navigateTo({
        url: '../aboutkangze/aboutkangze'
      })
    }
    if (index === 2) {
      wx.navigateTo({
        url: '../newsCenter/newsCenter'
      })
    }
    if (index === 3) {
      wx.navigateTo({
        url: '../mainBusiness/mainBusiness'
      })
    }
    if (index === 4) {
      wx.navigateTo({
        url: '../brandManagement/brandManagement'
      })
    }
    if (index === 5) {
      wx.navigateTo({
        url: '../talentDevelopment/talentDevelopment'
      })
    }
    if (index === 6) {
      wx.navigateTo({
        url: '../communicationCenter/communicationCenter'
      })
    }

    var that = this;
    this.setData({
      shopitem: classify,  //更新
    })
  },
  scrollTo(e) {
    this.setData({
      indexSize: e.currentTarget.dataset.index,
      imgindex: e.currentTarget.dataset.index,
    })
  },
  //滑动时当前页面的index
  onSlideChangeEnd: function (e) {
    var that = this;
    console.log(e.detail.current)
    that.setData({
      indexSize: e.detail.current,
      imgindex: e.detail.current
    })
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {

  }
})